#### Dev Environment Plan 📖
<details><summary>Show Plan</summary>
```terraform
module.backend.data.archive_file.webhook_zip: Reading...
module.backend.data.archive_file.lambda_zip: Reading...
module.backend.data.archive_file.stripe_layer_zip: Reading...
module.backend.data.archive_file.webhook_zip: Read complete after 0s [id=2b2a0722f50ac032a947e5ce087929d40773b68e]
module.backend.data.archive_file.lambda_zip: Read complete after 0s [id=b76ef36d86b36c4f8cba8621da7eb98b79b6a324]
module.frontend.aws_cloudfront_origin_access_control.default: Refreshing state... [id=E1D4T2JQQTCZIX]
module.backend.aws_iam_role.lambda_role: Refreshing state... [id=vstshop-lambda-role-dev]
module.backend.aws_api_gateway_rest_api.api: Refreshing state... [id=g6jnm33pu7]
module.storage.aws_s3_bucket.vst_storage: Refreshing state... [id=vst-storage-dev-195481994910]
module.database.aws_dynamodb_table.purchases: Refreshing state... [id=vstshop-purchases-dev]
module.frontend.aws_s3_bucket.frontend: Refreshing state... [id=vstshop-frontend-dev123]
module.auth.aws_cognito_user_pool.pool: Refreshing state... [id=us-east-2_V9hhjw2Y5]
module.backend.data.archive_file.stripe_layer_zip: Read complete after 1s [id=a146895af80ad46620d339ad58e4a699f9b0fd10]
module.backend.aws_lambda_layer_version.stripe_layer: Refreshing state... [id=arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:4]
module.backend.aws_api_gateway_resource.webhook: Refreshing state... [id=uilktp]
module.backend.aws_api_gateway_resource.check_vst: Refreshing state... [id=khqpyv]
module.backend.aws_api_gateway_method.webhook_post: Refreshing state... [id=agm-g6jnm33pu7-uilktp-POST]
module.backend.module.api_cors.aws_api_gateway_method._: Refreshing state... [id=agm-g6jnm33pu7-khqpyv-OPTIONS]
module.auth.aws_cognito_user_pool_domain.main: Refreshing state... [id=vstshop-dev-vst-dev-123]
module.backend.aws_api_gateway_authorizer.cognito: Refreshing state... [id=7wqxx7]
module.backend.module.api_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-g6jnm33pu7-khqpyv-OPTIONS-200]
module.backend.module.api_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-g6jnm33pu7-khqpyv-OPTIONS]
module.backend.aws_api_gateway_method.check_vst_get: Refreshing state... [id=agm-g6jnm33pu7-khqpyv-GET]
module.backend.module.api_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-g6jnm33pu7-khqpyv-OPTIONS-200]
module.backend.aws_lambda_function.stripe_webhook: Refreshing state... [id=vstshop-stripe-webhook-dev]
module.backend.aws_lambda_permission.apigw_webhook: Refreshing state... [id=AllowExecutionFromAPIGatewayWebhook]
module.backend.aws_api_gateway_integration.webhook_integration: Refreshing state... [id=agi-g6jnm33pu7-uilktp-POST]
module.frontend.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=vstshop-frontend-dev123]
module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E228GMNSTNHTAD]
module.storage.aws_s3_bucket_public_access_block.vst_storage_block: Refreshing state... [id=vst-storage-dev-195481994910]
module.backend.aws_iam_policy.lambda_combined_policy: Refreshing state... [id=arn:aws:iam::195481994910:policy/vstshop-lambda-combined-policy-dev]
module.backend.aws_lambda_function.vst_checker: Refreshing state... [id=vstshop-vst-checker-dev]
module.backend.aws_iam_role_policy_attachment.lambda_attach: Refreshing state... [id=vstshop-lambda-role-dev/arn:aws:iam::195481994910:policy/vstshop-lambda-combined-policy-dev]
module.frontend.aws_s3_bucket_policy.frontend_policy: Refreshing state... [id=vstshop-frontend-dev123]
module.storage.aws_s3_bucket_cors_configuration.vst_cors: Refreshing state... [id=vst-storage-dev-195481994910]
module.auth.aws_cognito_user_pool_client.client: Refreshing state... [id=2p1utd8g6jkts9qp59n7b5k9le]
module.backend.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.backend.aws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-g6jnm33pu7-khqpyv-GET]
module.backend.aws_api_gateway_deployment.deployment: Refreshing state... [id=78vxaz]
module.backend.aws_api_gateway_stage.this: Refreshing state... [id=ags-g6jnm33pu7-dev]
local_file.env_file: Refreshing state... [id=9ebf127f4251f8d1098d9b223024616c10c89532]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.backend.aws_lambda_function.stripe_webhook will be updated in-place
  ~ resource "aws_lambda_function" "stripe_webhook" {
        id                             = "vstshop-stripe-webhook-dev"
      ~ last_modified                  = "2026-02-18T22:04:45.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:4",
        ] -> (known after apply)
      ~ source_code_hash               = "7jvgowVivf/6+JmQLkgRS9ALSy0fNz5arZFPErUTLWc=" -> "FS3UvzPYxCvH5GqjkP7s569xsvElS+vlCjpJMs4fwXM="
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "STRIPE_WEBHOOK_SECRET" = (sensitive value)
                # (2 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.backend.aws_lambda_layer_version.stripe_layer must be replaced
+/- resource "aws_lambda_layer_version" "stripe_layer" {
      ~ arn                         = "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:4" -> (known after apply)
      ~ code_sha256                 = "fCdchcI6WhrR65zObOlItjFLkLioI3f6ztSRmp1tFNg=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-02-18T20:29:23.015+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:4" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "fCdchcI6WhrR65zObOlItjFLkLioI3f6ztSRmp1tFNg=" -> "D7PicBF6OLpr8teqZBWGqCvBn+AxDzPszF3K+Nltf2U=" # forces replacement
      ~ source_code_size            = 4677732 -> (known after apply)
      ~ version                     = "4" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>